robotter/robotter/avrs/aversive/include/aversive/parts/ATmega169.h
/* USISR */
#define USICNT0_REG          USISR
#define USICNT1_REG          USISR
#define USICNT2_REG          USISR
#define USICNT3_REG          USISR
#define USIDC_REG            USISR
#define USIPF_REG            USISR
#define USIOIF_REG           USISR
#define USISIF_REG           USISR

/* TCNT1H */
#define TCNT1H0_REG          TCNT1H
#define TCNT1H1_REG          TCNT1H
#define TCNT1H2_REG          TCNT1H
#define TCNT1H3_REG          TCNT1H
#define TCNT1H4_REG          TCNT1H
#define TCNT1H5_REG          TCNT1H
#define TCNT1H6_REG          TCNT1H
#define TCNT1H7_REG          TCNT1H

/* PORTC */
#define PORTC0_REG           PORTC
#define PORTC1_REG           PORTC
#define PORTC2_REG           PORTC
#define PORTC3_REG           PORTC
#define PORTC4_REG           PORTC
#define PORTC5_REG           PORTC
#define PORTC6_REG           PORTC
#define PORTC7_REG           PORTC

/* PORTA */
#define PORTA0_REG           PORTA
#define PORTA1_REG           PORTA
#define PORTA2_REG           PORTA
#define PORTA3_REG           PORTA
#define PORTA4_REG           PORTA
#define PORTA5_REG           PORTA
#define PORTA6_REG           PORTA
#define PORTA7_REG           PORTA

/* LCDDR8 */
#define SEG124_REG           LCDDR8

/* EICRA */
#define ISC00_REG            EICRA
#define ISC01_REG            EICRA

/* DIDR0 */
#define ADC0D_REG            DIDR0
#define ADC1D_REG            DIDR0
#define ADC2D_REG            DIDR0
#define ADC3D_REG            DIDR0
#define ADC4D_REG            DIDR0
#define ADC5D_REG            DIDR0
#define ADC6D_REG            DIDR0
#define ADC7D_REG            DIDR0

/* DIDR1 */
#define AIN0D_REG            DIDR1
#define AIN1D_REG            DIDR1

/* ASSR */
#define TCR2UB_REG           ASSR
#define OCR2UB_REG           ASSR
#define TCN2UB_REG           ASSR
#define AS2_REG              ASSR
#define EXCLK_REG            ASSR

/* CLKPR */
#define CLKPS0_REG           CLKPR
#define CLKPS1_REG           CLKPR
#define CLKPS2_REG           CLKPR
#define CLKPS3_REG           CLKPR
#define CLKPCE_REG           CLKPR

/* SREG */
#define C_REG                SREG
#define Z_REG                SREG
#define N_REG                SREG
#define V_REG                SREG
#define S_REG                SREG
#define H_REG                SREG
#define T_REG                SREG
#define I_REG                SREG

/* DDRB */
#define DDB0_REG             DDRB
#define DDB1_REG             DDRB
#define DDB2_REG             DDRB
#define DDB3_REG             DDRB
#define DDB4_REG             DDRB
#define DDB5_REG             DDRB
#define DDB6_REG             DDRB
#define DDB7_REG             DDRB

/* DDRC */
#define DDC0_REG             DDRC
#define DDC1_REG             DDRC
#define DDC2_REG             DDRC
#define DDC3_REG             DDRC
#define DDC4_REG             DDRC
#define DDC5_REG             DDRC
#define DDC6_REG             DDRC
#define DDC7_REG             DDRC

/* DDRA */
#define DDA0_REG             DDRA
#define DDA1_REG             DDRA
#define DDA2_REG             DDRA
#define DDA3_REG             DDRA
#define DDA4_REG             DDRA
#define DDA5_REG             DDRA
#define DDA6_REG             DDRA
#define DDA7_REG             DDRA

/* TCCR1A */
#define WGM10_REG            TCCR1A
#define WGM11_REG            TCCR1A
#define COM1B0_REG           TCCR1A
#define COM1B1_REG           TCCR1A
#define COM1A0_REG           TCCR1A
#define COM1A1_REG           TCCR1A

/* DDRG */
#define DDG0_REG             DDRG
#define DDG1_REG             DDRG
#define DDG2_REG             DDRG
#define DDG3_REG             DDRG
#define DDG4_REG             DDRG

/* TCCR1C */
#define FOC1B_REG            TCCR1C
#define FOC1A_REG            TCCR1C

/* TCCR1B */
#define CS10_REG             TCCR1B
#define CS11_REG             TCCR1B
#define CS12_REG             TCCR1B
#define WGM12_REG            TCCR1B
#define WGM13_REG            TCCR1B
#define ICES1_REG            TCCR1B
#define ICNC1_REG            TCCR1B

/* OSCCAL */
#define CAL0_REG             OSCCAL
#define CAL1_REG             OSCCAL
#define CAL2_REG             OSCCAL
#define CAL3_REG             OSCCAL
#define CAL4_REG             OSCCAL
#define CAL5_REG             OSCCAL
#define CAL6_REG             OSCCAL
#define CAL7_REG             OSCCAL

/* LCDDR3 */
#define SEG024_REG           LCDDR3

/* LCDDR2 */
#define SEG016_REG           LCDDR2
#define SEG017_REG           LCDDR2
#define SEG018_REG           LCDDR2
#define SEG019_REG           LCDDR2
#define SEG020_REG           LCDDR2
#define SEG021_REG           LCDDR2
#define SEG022_REG           LCDDR2
#define SEG023_REG           LCDDR2

/* LCDDR1 */
#define SEG008_REG           LCDDR1
#define SEG009_REG           LCDDR1
#define SEG010_REG           LCDDR1
#define SEG011_REG           LCDDR1
#define SEG012_REG           LCDDR1
#define SEG013_REG           LCDDR1
#define SEG014_REG           LCDDR1
#define SEG015_REG           LCDDR1

/* LCDDR0 */
#define SEG000_REG           LCDDR0
#define SEG001_REG           LCDDR0
#define SEG002_REG           LCDDR0
#define SEG003_REG           LCDDR0
#define SEG004_REG           LCDDR0
#define SEG005_REG           LCDDR0
#define SEG006_REG           LCDDR0
#define SEG007_REG           LCDDR0

/* LCDDR7 */
#define SEG116_REG           LCDDR7
#define SEG117_REG           LCDDR7
#define SEG118_REG           LCDDR7
#define SEG119_REG           LCDDR7
#define SEG120_REG           LCDDR7
#define SEG121_REG           LCDDR7
#define SEG122_REG           LCDDR7
#define SEG123_REG           LCDDR7

/* LCDDR6 */
#define SEG108_REG           LCDDR6
#define SEG109_REG           LCDDR6
#define SEG110_REG           LCDDR6
#define SEG111_REG           LCDDR6
#define SEG112_REG           LCDDR6
#define SEG113_REG           LCDDR6
#define SEG114_REG           LCDDR6
#define SEG115_REG           LCDDR6

/* LCDDR5 */
#define SEG100_REG           LCDDR5
#define SEG101_REG           LCDDR5
#define SEG102_REG           LCDDR5
#define SEG103_REG           LCDDR5
#define SEG104_REG           LCDDR5
#define SEG105_REG           LCDDR5
#define SEG106_REG           LCDDR5
#define SEG107_REG           LCDDR5

