robotter/robotter/avrs/aversive/include/aversive/parts/ATmega169.h
/* GPIOR1 */
#define GPIOR10_REG          GPIOR1
#define GPIOR11_REG          GPIOR1
#define GPIOR12_REG          GPIOR1
#define GPIOR13_REG          GPIOR1
#define GPIOR14_REG          GPIOR1
#define GPIOR15_REG          GPIOR1
#define GPIOR16_REG          GPIOR1
#define GPIOR17_REG          GPIOR1

/* GPIOR0 */
#define GPIOR00_REG          GPIOR0
#define GPIOR01_REG          GPIOR0
#define GPIOR02_REG          GPIOR0
#define GPIOR03_REG          GPIOR0
#define GPIOR04_REG          GPIOR0
#define GPIOR05_REG          GPIOR0
#define GPIOR06_REG          GPIOR0
#define GPIOR07_REG          GPIOR0

/* GPIOR2 */
#define GPIOR20_REG          GPIOR2
#define GPIOR21_REG          GPIOR2
#define GPIOR22_REG          GPIOR2
#define GPIOR23_REG          GPIOR2
#define GPIOR24_REG          GPIOR2
#define GPIOR25_REG          GPIOR2
#define GPIOR26_REG          GPIOR2
#define GPIOR27_REG          GPIOR2

/* LCDCRA */
#define LCDBL_REG            LCDCRA
#define LCDCCD_REG           LCDCRA
#define LCDBD_REG            LCDCRA
#define LCDIE_REG            LCDCRA
#define LCDIF_REG            LCDCRA
#define LCDAB_REG            LCDCRA
#define LCDEN_REG            LCDCRA

/* DDRE */
#define DDE0_REG             DDRE
#define DDE1_REG             DDRE
#define DDE2_REG             DDRE
#define DDE3_REG             DDRE
#define DDE4_REG             DDRE
#define DDE5_REG             DDRE
#define DDE6_REG             DDRE
#define DDE7_REG             DDRE

/* TCNT2 */
#define TCNT2_0_REG          TCNT2
#define TCNT2_1_REG          TCNT2
#define TCNT2_2_REG          TCNT2
#define TCNT2_3_REG          TCNT2
#define TCNT2_4_REG          TCNT2
#define TCNT2_5_REG          TCNT2
#define TCNT2_6_REG          TCNT2
#define TCNT2_7_REG          TCNT2

/* TCNT0 */
#define TCNT0_0_REG          TCNT0
#define TCNT0_1_REG          TCNT0
#define TCNT0_2_REG          TCNT0
#define TCNT0_3_REG          TCNT0
#define TCNT0_4_REG          TCNT0
#define TCNT0_5_REG          TCNT0
#define TCNT0_6_REG          TCNT0
#define TCNT0_7_REG          TCNT0

/* TCCR0A */
#define CS00_REG             TCCR0A
#define CS01_REG             TCCR0A
#define CS02_REG             TCCR0A
#define WGM01_REG            TCCR0A
#define COM0A0_REG           TCCR0A
#define COM0A1_REG           TCCR0A
#define WGM00_REG            TCCR0A
#define FOC0A_REG            TCCR0A

/* TIFR2 */
#define TOV2_REG             TIFR2
#define OCF2A_REG            TIFR2

/* SPCR */
#define SPR0_REG             SPCR
#define SPR1_REG             SPCR
#define CPHA_REG             SPCR
#define CPOL_REG             SPCR
#define MSTR_REG             SPCR
#define DORD_REG             SPCR
#define SPE_REG              SPCR
#define SPIE_REG             SPCR

/* TIFR1 */
#define TOV1_REG             TIFR1
#define OCF1A_REG            TIFR1
#define OCF1B_REG            TIFR1
#define ICF1_REG             TIFR1

/* GTCCR */
#define PSR310_REG           GTCCR
#define TSM_REG              GTCCR
#define PSR2_REG             GTCCR

/* ICR1H */
#define ICR1H0_REG           ICR1H
#define ICR1H1_REG           ICR1H
#define ICR1H2_REG           ICR1H
#define ICR1H3_REG           ICR1H
#define ICR1H4_REG           ICR1H
#define ICR1H5_REG           ICR1H
#define ICR1H6_REG           ICR1H
#define ICR1H7_REG           ICR1H

/* LCDCRB */
#define LCDPM0_REG           LCDCRB
#define LCDPM1_REG           LCDCRB
#define LCDPM2_REG           LCDCRB
#define LCDMUX0_REG          LCDCRB
#define LCDMUX1_REG          LCDCRB
#define LCD2B_REG            LCDCRB
#define LCDCS_REG            LCDCRB

/* LCDDR18 */
#define SEG324_REG           LCDDR18

/* LCDDR13 */
#define SEG224_REG           LCDDR13

/* LCDDR12 */
#define SEG216_REG           LCDDR12
#define SEG217_REG           LCDDR12
#define SEG218_REG           LCDDR12
#define SEG219_REG           LCDDR12
#define SEG220_REG           LCDDR12
#define SEG221_REG           LCDDR12
#define SEG222_REG           LCDDR12
#define SEG223_REG           LCDDR12

/* LCDDR11 */
#define SEG208_REG           LCDDR11
#define SEG209_REG           LCDDR11
#define SEG210_REG           LCDDR11
#define SEG211_REG           LCDDR11
#define SEG212_REG           LCDDR11
#define SEG213_REG           LCDDR11
#define SEG214_REG           LCDDR11
#define SEG215_REG           LCDDR11

/* LCDDR10 */
#define SEG200_REG           LCDDR10
#define SEG201_REG           LCDDR10
#define SEG202_REG           LCDDR10
#define SEG203_REG           LCDDR10
#define SEG204_REG           LCDDR10
#define SEG205_REG           LCDDR10
#define SEG206_REG           LCDDR10
#define SEG207_REG           LCDDR10

/* LCDDR17 */
#define SEG316_REG           LCDDR17
#define SEG317_REG           LCDDR17
#define SEG318_REG           LCDDR17
#define SEG319_REG           LCDDR17
#define SEG320_REG           LCDDR17
#define SEG321_REG           LCDDR17
#define SEG322_REG           LCDDR17
#define SEG323_REG           LCDDR17

/* LCDDR16 */
#define SEG308_REG           LCDDR16
#define SEG309_REG           LCDDR16
#define SEG310_REG           LCDDR16
#define SEG311_REG           LCDDR16
#define SEG312_REG           LCDDR16
#define SEG313_REG           LCDDR16
#define SEG314_REG           LCDDR16
#define SEG315_REG           LCDDR16

/* LCDDR15 */
#define SEG300_REG           LCDDR15
#define SEG301_REG           LCDDR15
#define SEG302_REG           LCDDR15
#define SEG303_REG           LCDDR15
#define SEG304_REG           LCDDR15
#define SEG305_REG           LCDDR15
#define SEG306_REG           LCDDR15
#define SEG307_REG           LCDDR15

/* OCR1BL */
#define OCR1BL0_REG          OCR1BL
#define OCR1BL1_REG          OCR1BL
#define OCR1BL2_REG          OCR1BL
#define OCR1BL3_REG          OCR1BL
#define OCR1BL4_REG          OCR1BL
#define OCR1BL5_REG          OCR1BL
#define OCR1BL6_REG          OCR1BL
#define OCR1BL7_REG          OCR1BL

/* OCR1BH */
#define OCR1BH0_REG          OCR1BH
#define OCR1BH1_REG          OCR1BH
#define OCR1BH2_REG          OCR1BH
#define OCR1BH3_REG          OCR1BH
#define OCR1BH4_REG          OCR1BH
#define OCR1BH5_REG          OCR1BH
#define OCR1BH6_REG          OCR1BH
#define OCR1BH7_REG          OCR1BH

